# SQL In Notebooks  
https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc  
https://tereshenkov.wordpress.com/2018/02/22/working-with-sql-in-jupyter-notebook-and-dumping-pandas-into-a-sql-database/  
https://towardsdatascience.com/do-you-know-python-has-a-built-in-database-d553989c87bd  

`conda install -c conda-forge ipython-sql`

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [4]:
%%sql
CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);

 * sqlite://
Done.
6 rows affected.

[]

In [6]:
%%sql
select * from sales;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [8]:
# Jupyter trick - previous to variable
result = _

In [9]:
type(result)

sql.run.ResultSet

In [10]:
# put in dataframe
df = result.DataFrame()

In [11]:
df

      key                ts  product  completed  price
0  sale_1  2019-11-08 00:00        0          1    1.1
1  sale_2  2019-11-08 01:00        0          0    1.2
2  sale_3  2019-11-08 01:00        0          1    1.3
3  sale_4  2019-11-08 01:00        1          0    1.4
4  sale_5  2019-11-08 02:00        1          1    1.5
5  sale_6  2019-11-08 02:00        1          1    1.5

## Postgres  
- assumes running locally for default connection

In [14]:
%sql postgresql://postgres:postgres@localhost/Rob

'Connected: postgres@Rob'

In [15]:
new_table = df

In [16]:
%sql PERSIST new_table

 * postgresql://postgres:***@localhost/Rob
   sqlite://

'Persisted new_table'

In [17]:
%sql select * from new_table

 * postgresql://postgres:***@localhost/Rob
   sqlite://
6 rows affected.

[(0, 'sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 (1, 'sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 (2, 'sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 (3, 'sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 (4, 'sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 (5, 'sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

## Alternative - Python/SQLite only (not other DBs)

In [27]:
import sqlite3 as sl
import pandas as pd

In [20]:
con = sl.connect('./data/sql-test.db')

In [21]:
with con:
    con.execute("""
        CREATE TABLE USER (
            id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
            name TEXT,
            age INTEGER
        );
    """)

In [22]:
sql = 'INSERT INTO USER (id, name, age) values(?, ?, ?)'
data = [
    (1, 'Alice', 21),
    (2, 'Bob', 22),
    (3, 'Chris', 23)
]

In [23]:
with con:
    con.executemany(sql, data)

In [24]:
with con:
    data = con.execute("SELECT * FROM USER WHERE age <= 22")
    for row in data:
        print(row)

(1, 'Alice', 21)
(2, 'Bob', 22)

Note:
You can connect to SQLite DB from SQL Client (DBeaver)

### Pandas integration

In [28]:
df_skill = pd.DataFrame({
    'user_id': [1,1,2,2,3,3,3],
    'skill': ['Network Security', 'Algorithm Development', 'Network Security', 'Java', 'Python', 'Data Science', 'Machine Learning']
})

In [29]:
df_skill

   user_id                  skill
0        1       Network Security
1        1  Algorithm Development
2        2       Network Security
3        2                   Java
4        3                 Python
5        3           Data Science
6        3       Machine Learning

In [30]:
# save to db
df_skill.to_sql('SKILL', con)

In [31]:
# join
df = pd.read_sql('''
    SELECT s.user_id, u.name, u.age, s.skill 
    FROM USER u LEFT JOIN SKILL s ON u.id = s.user_id
''', con)

In [32]:
df

   user_id   name  age                  skill
0        1  Alice   21  Algorithm Development
1        1  Alice   21       Network Security
2        2    Bob   22                   Java
3        2    Bob   22       Network Security
4        3  Chris   23           Data Science
5        3  Chris   23       Machine Learning
6        3  Chris   23                 Python

In [33]:
# save that
df.to_sql('USER_SKILL', con)